
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	
	  // Сушкова Е.Н. Домашнее задание по теме "Внесение изменений в конфигурацию на поддержке"
	   Если Элементы.Найти ( "КонтактныеЛица") = Неопределено Тогда
		ДобавлениеКонтактныеЛица = Элементы.Добавить("ДЗКонтактныеЛица",Тип("ПолеФормы"),Элементы.ГруппаШапкаПраво);
		ДобавлениеКонтактныеЛица.ПутьКДанным = "Объект.ДЗКонтактныеЛица";
		ДобавлениеКонтактныеЛица.Вид = ВидПоляФормы.ПолеВвода;
		ДобавлениеКонтактныеЛица.Заголовок = "Контактное лицо"; 		
	КонецЕсли; 

	Если Элементы.Найти ("Скидка") = Неопределено Тогда
		ДобавлениеСкидка = Элементы.Добавить("ДЗСкидка",Тип("ПолеФормы"),Элементы.ГруппаШапкаПраво);
		ДобавлениеСкидка.ПутьКДанным = "Объект.ДЗСкидка";
		ДобавлениеСкидка.Вид = ВидПоляФормы.ПолеВвода;		
		ДобавлениеСкидка.Заголовок = "Скидка";
		ДобавлениеСкидка.УстановитьДействие("ПриИзменении","ПриИзмененииСкидки");
		
		
	КонецЕсли;  

	Если Элементы.Найти ("ПересчитатьСумму") = Неопределено Тогда
		Команда = Команды.Добавить ("ПересчитатьСумму"); 
		Команда.Заголовок = "Пересчитать сумму";
		Команда.Действие = "КомандаПересчитатьСумму";
		
		КнопкаКоманды = Элементы.Добавить("ПересчитатьСумму",Тип ("КнопкаФормы"), Элементы.ГруппаШапкаПраво);
		КнопкаКоманды.ИмяКоманды = "ПересчитатьСумму";
		КнопкаКоманды.Вид = ВидКнопкиФормы.ОбычнаяКнопка; 
		КнопкаКоманды.Картинка = БиблиотекаКартинок.Обновить; 
		КнопкаКоманды.Отображение = ОтображениеКнопки.Картинка;
		
	КонецЕсли;	
	  // Сушкова Е.Н. Конец домашнего задания	
	
КонецПроцедуры

&НаКлиенте 
 Процедура КомандаПересчитатьСумму();

  // Сушкова Е.Н. Домашнее задание по теме "Внесение изменений в конфигурацию на поддержке"  
  
  ТЗТовары = Объект.Товары; 
 ТЗУслуги = Объект.Услуги;	 
 Для Каждого ЭлементаТЗТовары из ТЗТовары Цикл 		 
	  РассчитатьСуммуСтроки(ЭлементаТЗТовары);		 
 КонецЦикла; 	 
 Для Каждого ЭлементаТЗУслуги из ТЗУслуги Цикл 
	 РассчитатьСуммуСтроки(ЭлементаТЗУслуги);
 КонецЦикла; 
 
  // Сушкова Е.Н. Конец домашнего задания	
	 				
КонецПроцедуры

&НаКлиенте 
  Асинх Процедура ПриИзмененииСкидки() 
	  
  // Сушкова Е.Н. Домашнее задание по теме "Внесение изменений в конфигурацию на поддержке" 
  
  ТЗТовары = Объект.Товары;  
  ТЗУслуги = Объект.Услуги;
  Если Не ЗначениеЗаполнено(Объект.Товары) и Не ЗначениеЗаполнено(Объект.Услуги) тогда
	  Возврат;		
  Иначе
	  Ответ = Ждать ВопросАсинх ("Пересчитать сумму номенклатуры и услуги с учетом скидки?", РежимДиалогаВопрос.ДаНет);			
	  Если Ответ  =  КодВозвратаДиалога.Да Тогда 			
		  КомандаПересчитатьСумму();		
	  Иначе 
		  Возврат;
	  КонецЕсли; 
  КонецЕсли;	
  
  // Сушкова Е.Н. Конец домашнего задания
	  
  КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти
